html/frontend/a-html+css.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2023-02-27 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>HTML/CSS</title>
<meta name="author" content="1a2y" />
<meta name="generator" content="Org Mode" />
<link rel='stylesheet' href='/html/asset/common.css?3344' />
<link rel='stylesheet' href='/yaoliuyao/html/asset/common.css?3344' />
</head>
<body>
<div id="content" class="content">
<header>
<h1 class="title">HTML/CSS</h1>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org59b8592">1. html</a>
<ul>
<li><a href="#org8e7d8d1">1.1. html5 中的标签（语义化）</a></li>
<li><a href="#orgbc84354">1.2. table 标签</a></li>
</ul>
</li>
<li><a href="#org7af71a2">2. CSS</a>
<ul>
<li><a href="#orgd75e558">2.1. 网页布局 (Layout)</a>
<ul>
<li><a href="#orgaf4e7b1">2.1.1. Display/Position (盒子模型/文档流)</a></li>
<li><a href="#org000f2f1">2.1.2. Float, 浮动</a></li>
<li><a href="#org6bcb930">2.1.3. Flexbox, 弹性盒子</a></li>
<li><a href="#orgfae4823">2.1.4. Grid, 网格布局</a></li>
</ul>
</li>
<li><a href="#orgd5ee0d3">2.2. Viewport</a></li>
<li><a href="#org75b7c43">2.3. Media Query</a></li>
<li><a href="#orgc84f6f6">2.4. CDN (Content Delivery Network)</a></li>
</ul>
</li>
<li><a href="#orgde797d6">3. bootstrap.css</a></li>
</ul>
</div>
</nav>


<section id="outline-container-org59b8592" class="outline-2">
<h2 id="org59b8592"><span class="section-number-2">1.</span> html</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org8e7d8d1" class="outline-3">
<h3 id="org8e7d8d1"><span class="section-number-3">1.1.</span> html5 中的标签（语义化）</h3>
<div class="outline-text-3" id="text-1-1">
<p>
内置的一些标签:
</p>
<ul class="org-ul">
<li>section，部分</li>
<li>article，文章</li>
<li>aside, 侧边</li>
<li>header/footer</li>
</ul>

<div class="org-src-container">
<pre class="src src-html"><span style="color: #000000;">&lt;</span><span style="color: #721045;">article</span><span style="color: #000000;">&gt;</span>
  <span style="color: #000000;">&lt;</span><span style="color: #721045;">header</span><span style="color: #000000;">&gt;</span>
    <span style="color: #000000;">&lt;</span><span style="color: #721045;">h3</span><span style="color: #000000;">&gt;</span><span style="font-style: italic; text-decoration: underline;">&#25105;&#26159;&#19968;&#31687;&#25991;&#31456;&#30340;&#26631;&#39064;</span><span style="color: #000000;">&lt;</span>/<span style="color: #721045;">h3</span><span style="color: #000000;">&gt;</span>
    <span style="color: #000000;">&lt;</span><span style="color: #721045;">span</span><span style="color: #000000;">&gt;</span>&#21457;&#34920;&#26085;&#26399;: xxxxx<span style="color: #000000;">&lt;</span>/<span style="color: #721045;">span</span><span style="color: #000000;">&gt;</span>
    <span style="color: #000000;">&lt;</span><span style="color: #721045;">span</span><span style="color: #000000;">&gt;</span>&#20316;&#32773;&#21517;&#23383;: xxxxx<span style="color: #000000;">&lt;</span>/<span style="color: #721045;">span</span><span style="color: #000000;">&gt;</span>
  <span style="color: #000000;">&lt;</span>/<span style="color: #721045;">header</span><span style="color: #000000;">&gt;</span>

  <span style="color: #000000;">&lt;</span><span style="color: #721045;">div</span><span style="color: #000000;">&gt;</span>
    <span style="color: #000000;">&lt;</span><span style="color: #721045;">p</span><span style="color: #000000;">&gt;</span>ksdjfksd<span style="color: #000000;">&lt;</span>/<span style="color: #721045;">p</span><span style="color: #000000;">&gt;</span>
  <span style="color: #000000;">&lt;</span>/<span style="color: #721045;">div</span><span style="color: #000000;">&gt;</span>

  <span style="color: #000000;">&lt;</span><span style="color: #721045;">div</span><span style="color: #000000;">&gt;</span>
    <span style="color: #000000;">&lt;</span><span style="color: #721045;">p</span><span style="color: #000000;">&gt;</span>ksdjfksd<span style="color: #000000;">&lt;</span>/<span style="color: #721045;">p</span><span style="color: #000000;">&gt;</span>
  <span style="color: #000000;">&lt;</span>/<span style="color: #721045;">div</span><span style="color: #000000;">&gt;</span>

  <span style="color: #000000;">&lt;</span><span style="color: #721045;">footer</span><span style="color: #000000;">&gt;</span>
    <span style="color: #000000;">&lt;</span><span style="color: #721045;">p</span><span style="color: #000000;">&gt;</span>&#32034;&#24341;&#20449;&#24687;...<span style="color: #000000;">&lt;</span>/<span style="color: #721045;">p</span><span style="color: #000000;">&gt;</span>
    <span style="color: #000000;">&lt;</span><span style="color: #721045;">p</span><span style="color: #000000;">&gt;</span>&#27426;&#36814;&#35746;&#38405;...<span style="color: #000000;">&lt;</span>/<span style="color: #721045;">p</span><span style="color: #000000;">&gt;</span>
  <span style="color: #000000;">&lt;</span>/<span style="color: #721045;">footer</span><span style="color: #000000;">&gt;</span>
<span style="color: #000000;">&lt;</span>/<span style="color: #721045;">article</span><span style="color: #000000;">&gt;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbc84354" class="outline-3">
<h3 id="orgbc84354"><span class="section-number-3">1.2.</span> table 标签</h3>
<div class="outline-text-3" id="text-1-2">
<p>
虽然你可以简写为:
</p>
<div class="org-src-container">
<pre class="src src-html"><span style="color: #000000;">&lt;</span><span style="color: #721045;">table</span><span style="color: #000000;">&gt;</span>
  <span style="color: #000000;">&lt;</span><span style="color: #721045;">tr</span><span style="color: #000000;">&gt;</span>
    <span style="color: #000000;">&lt;</span><span style="color: #721045;">th</span><span style="color: #000000;">&gt;&lt;</span>/<span style="color: #721045;">th</span><span style="color: #000000;">&gt;</span>
    <span style="color: #000000;">&lt;</span><span style="color: #721045;">th</span><span style="color: #000000;">&gt;&lt;</span>/<span style="color: #721045;">th</span><span style="color: #000000;">&gt;</span>
    <span style="color: #000000;">&lt;</span><span style="color: #721045;">th</span><span style="color: #000000;">&gt;&lt;</span>/<span style="color: #721045;">th</span><span style="color: #000000;">&gt;</span>
  <span style="color: #000000;">&lt;</span>/<span style="color: #721045;">tr</span><span style="color: #000000;">&gt;</span>
  <span style="color: #000000;">&lt;</span><span style="color: #721045;">tr</span><span style="color: #000000;">&gt;</span>
    <span style="color: #000000;">&lt;</span><span style="color: #721045;">td</span><span style="color: #000000;">&gt;&lt;</span>/<span style="color: #721045;">td</span><span style="color: #000000;">&gt;</span>
    <span style="color: #000000;">&lt;</span><span style="color: #721045;">td</span><span style="color: #000000;">&gt;&lt;</span>/<span style="color: #721045;">td</span><span style="color: #000000;">&gt;</span>
    <span style="color: #000000;">&lt;</span><span style="color: #721045;">td</span><span style="color: #000000;">&gt;&lt;</span>/<span style="color: #721045;">td</span><span style="color: #000000;">&gt;</span>
  <span style="color: #000000;">&lt;</span>/<span style="color: #721045;">tr</span><span style="color: #000000;">&gt;</span>
  <span style="color: #000000;">&lt;</span><span style="color: #721045;">tr</span><span style="color: #000000;">&gt;</span>
    <span style="color: #000000;">&lt;</span><span style="color: #721045;">td</span><span style="color: #000000;">&gt;&lt;</span>/<span style="color: #721045;">td</span><span style="color: #000000;">&gt;</span>
    <span style="color: #000000;">&lt;</span><span style="color: #721045;">td</span><span style="color: #000000;">&gt;&lt;</span>/<span style="color: #721045;">td</span><span style="color: #000000;">&gt;</span>
    <span style="color: #000000;">&lt;</span><span style="color: #721045;">td</span><span style="color: #000000;">&gt;&lt;</span>/<span style="color: #721045;">td</span><span style="color: #000000;">&gt;</span>
  <span style="color: #000000;">&lt;</span>/<span style="color: #721045;">tr</span><span style="color: #000000;">&gt;</span>
<span style="color: #000000;">&lt;</span>/<span style="color: #721045;">table</span><span style="color: #000000;">&gt;</span>
</pre>
</div>

<p>
但是，它的全写格式却含有 thead/tbody:
</p>
<div class="org-src-container">
<pre class="src src-html"><span style="color: #000000;">&lt;</span><span style="color: #721045;">table</span><span style="color: #000000;">&gt;</span>
  <span style="color: #000000;">&lt;</span><span style="color: #721045;">thead</span><span style="color: #000000;">&gt;</span>
    <span style="color: #000000;">&lt;</span><span style="color: #721045;">tr</span><span style="color: #000000;">&gt;</span>
      <span style="color: #000000;">&lt;</span><span style="color: #721045;">th</span><span style="color: #000000;">&gt;&lt;</span>/<span style="color: #721045;">th</span><span style="color: #000000;">&gt;</span>
      <span style="color: #000000;">&lt;</span><span style="color: #721045;">th</span><span style="color: #000000;">&gt;&lt;</span>/<span style="color: #721045;">th</span><span style="color: #000000;">&gt;</span>
      <span style="color: #000000;">&lt;</span><span style="color: #721045;">th</span><span style="color: #000000;">&gt;&lt;</span>/<span style="color: #721045;">th</span><span style="color: #000000;">&gt;</span>
    <span style="color: #000000;">&lt;</span>/<span style="color: #721045;">tr</span><span style="color: #000000;">&gt;</span>
  <span style="color: #000000;">&lt;</span>/<span style="color: #721045;">thead</span><span style="color: #000000;">&gt;</span>
  <span style="color: #000000;">&lt;</span><span style="color: #721045;">tbody</span><span style="color: #000000;">&gt;</span>
    <span style="color: #000000;">&lt;</span><span style="color: #721045;">tr</span><span style="color: #000000;">&gt;</span>
      <span style="color: #000000;">&lt;</span><span style="color: #721045;">td</span><span style="color: #000000;">&gt;&lt;</span>/<span style="color: #721045;">td</span><span style="color: #000000;">&gt;</span>
      <span style="color: #000000;">&lt;</span><span style="color: #721045;">td</span><span style="color: #000000;">&gt;&lt;</span>/<span style="color: #721045;">td</span><span style="color: #000000;">&gt;</span>
      <span style="color: #000000;">&lt;</span><span style="color: #721045;">td</span><span style="color: #000000;">&gt;&lt;</span>/<span style="color: #721045;">td</span><span style="color: #000000;">&gt;</span>
    <span style="color: #000000;">&lt;</span>/<span style="color: #721045;">tr</span><span style="color: #000000;">&gt;</span>
    <span style="color: #000000;">&lt;</span><span style="color: #721045;">tr</span><span style="color: #000000;">&gt;</span>
      <span style="color: #000000;">&lt;</span><span style="color: #721045;">td</span><span style="color: #000000;">&gt;&lt;</span>/<span style="color: #721045;">td</span><span style="color: #000000;">&gt;</span>
      <span style="color: #000000;">&lt;</span><span style="color: #721045;">td</span><span style="color: #000000;">&gt;&lt;</span>/<span style="color: #721045;">td</span><span style="color: #000000;">&gt;</span>
      <span style="color: #000000;">&lt;</span><span style="color: #721045;">td</span><span style="color: #000000;">&gt;&lt;</span>/<span style="color: #721045;">td</span><span style="color: #000000;">&gt;</span>
    <span style="color: #000000;">&lt;</span>/<span style="color: #721045;">tr</span><span style="color: #000000;">&gt;</span>
  <span style="color: #000000;">&lt;</span>/<span style="color: #721045;">tbody</span><span style="color: #000000;">&gt;</span>
<span style="color: #000000;">&lt;</span>/<span style="color: #721045;">table</span><span style="color: #000000;">&gt;</span>
</pre>
</div>
</div>
</div>
</section>

<section id="outline-container-org7af71a2" class="outline-2">
<h2 id="org7af71a2"><span class="section-number-2">2.</span> CSS</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgd75e558" class="outline-3">
<h3 id="orgd75e558"><span class="section-number-3">2.1.</span> 网页布局 (Layout)</h3>
<div class="outline-text-3" id="text-2-1">
</div>
<div id="outline-container-orgaf4e7b1" class="outline-4">
<h4 id="orgaf4e7b1"><span class="section-number-4">2.1.1.</span> Display/Position (盒子模型/文档流)</h4>
<div class="outline-text-4" id="text-2-1-1">
<p>
每一个元素可以通过 display 设置其在盒子模型中的默认渲染行为:
</p>
<ul class="org-ul">
<li>block</li>
<li>inline</li>
</ul>

<p>
页面的布局基于文档流。通过设置 position 可以改变文档流的一些行为:
</p>
<ul class="org-ul">
<li>static</li>
<li>relative</li>
<li>absolute</li>
<li>fixed</li>
</ul>
</div>
</div>

<div id="outline-container-org000f2f1" class="outline-4">
<h4 id="org000f2f1"><span class="section-number-4">2.1.2.</span> Float, 浮动</h4>
<div class="outline-text-4" id="text-2-1-2">
<p>
一种将元素脱离正常的文档流，单独为其设置位置的方式。
</p>

<div class="org-src-container">
<pre class="src src-css"><span style="color: #531ab6;">div </span><span style="color: #000000;">{</span> <span style="color: #005f5f;">float</span>: right; <span style="color: #000000;">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org6bcb930" class="outline-4">
<h4 id="org6bcb930"><span class="section-number-4">2.1.3.</span> Flexbox, 弹性盒子</h4>
<div class="outline-text-4" id="text-2-1-3">
<div class="org-src-container">
<pre class="src src-css"><span style="color: #531ab6;">.container</span>
<span style="color: #000000;">{</span>
    <span style="color: #005f5f;">display</span>: flex;
    <span style="color: #005f5f;">justify-content</span>: center;
<span style="color: #000000;">}</span>
<span style="color: #531ab6;">.item</span>
<span style="color: #000000;">{</span>
    <span style="color: #005f5f;">flex-flow</span>: 1;
<span style="color: #000000;">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgfae4823" class="outline-4">
<h4 id="orgfae4823"><span class="section-number-4">2.1.4.</span> Grid, 网格布局</h4>
<div class="outline-text-4" id="text-2-1-4">
<div class="org-src-container">
<pre class="src src-css"><span style="color: #531ab6;">.container</span>
<span style="color: #000000;">{</span>
    <span style="color: #005f5f;">display</span>: grid;
    <span style="color: #005f5f;">grid-template-columns</span>: 1fr 2fr auto;
    <span style="color: #005f5f;">grid-gap</span>: 1em;
<span style="color: #000000;">}</span>
<span style="color: #531ab6;">.itemX</span>
<span style="color: #000000;">{</span>
    <span style="color: #005f5f;">grid-row</span>: 1 / 5;
<span style="color: #000000;">}</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgd5ee0d3" class="outline-3">
<h3 id="orgd5ee0d3"><span class="section-number-3">2.2.</span> Viewport</h3>
<div class="outline-text-3" id="text-2-2">
<p>
对于这样的 CSS 样式:
</p>
<pre class="example">
body { width: 1024px }
</pre>


<p>
以前的 PC 上是按照真实分辨率渲染的，自然没问题。
</p>

<p>
可是后来出现了移动设备，屏幕普遍小。只能通过缩放将页面展示到上，因此字体会特别小，难以看清。
</p>

<p>
如何解决这个问题？苹果当初引入了 Viewport 的概念 (虚拟的屏幕 &#x2014;&gt; 实际的屏幕):
</p>
<ol class="org-ol">
<li>创建一个虚拟的的区域 <code>Layout Viewport</code> 宽度近乎 PC，然后将网页中内容渲染到上面</li>
<li>将上述 Viewport 中的内容，映射呈现到真实的屏幕上</li>
</ol>

<p>
于是我们就可以看到一个可以缩放、带滚动条的页面，甚至可以呈现跟 PC 一样的效果:
</p>
<ul class="org-ul">
<li>可以通过调整 Viewport 的各种参数，达到不同的渲染效果</li>
<li>如果将 width 设置为 device-width，PC 端几乎不受影响，绝大多数手机端的 viewport 将会有 320px 左右的宽度。
那么如果一个按钮，设置其 width=80px，那么它渲染出的效果是占 1/4 个屏幕宽度的空间。</li>
<li>当然，不同设备的 device-width 是不一样的，比如 iPad 大约是 700px+。这种情况下，就需要借助 Media Type 为不同设备适配单独的 CSS 样式了</li>
</ul>

<p>
代码:
</p>
<div class="org-src-container">
<pre class="src src-html"><span style="color: #000000;">&lt;</span><span style="color: #721045;">meta</span> <span style="color: #005e8b;">name</span>=<span style="color: #3548cf;">"viewport"</span> <span style="color: #005e8b;">content</span>=<span style="color: #3548cf;">"width=2000px, initial-scale=1, user-scalable=no"</span><span style="color: #000000;">&gt;</span>
<span style="color: #000000;">&lt;</span><span style="color: #721045;">meta</span> <span style="color: #005e8b;">name</span>=<span style="color: #3548cf;">"viewport"</span> <span style="color: #005e8b;">content</span>=<span style="color: #3548cf;">"width=device-width"</span><span style="color: #000000;">&gt;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org75b7c43" class="outline-3">
<h3 id="org75b7c43"><span class="section-number-3">2.3.</span> Media Query</h3>
<div class="outline-text-3" id="text-2-3">
<p>
为了在不同设备上渲染不同的样式，CSS 推出了 Media Query 的概念。
</p>

<p>
媒体查询，语法:
</p>
<pre class="example">
@media not|only MediaType and (MediaFeatureExpressions) { CSS }
</pre>


<p>
示例:
</p>
<div class="org-src-container">
<pre class="src src-css"><span style="color: #531ab6;">div</span>
<span style="color: #000000;">{</span>
    <span style="color: #005f5f;">color</span>: <span style="color: #ffffff; background-color: #ff0000;">red</span>;
<span style="color: #000000;">}</span>

<span style="color: #8f0075;">@media</span> screen and <span style="color: #000000;">(</span>max-device-with: 960px<span style="color: #000000;">)</span>
<span style="color: #000000;">{</span>
    <span style="color: #531ab6;">div</span>
<span style="color: #531ab6;">    </span><span style="color: #dd22dd;">{</span>
        <span style="color: #005f5f;">color</span>: <span style="color: #ffffff; background-color: #008000;">green</span>;
    <span style="color: #dd22dd;">}</span>
<span style="color: #000000;">}</span>

<span style="color: #8f0075;">@media</span> <span style="color: #000000;">(</span>min-width: 2000px<span style="color: #000000;">)</span>
<span style="color: #000000;">{</span>
    <span style="color: #531ab6;">div</span>
<span style="color: #531ab6;">    </span><span style="color: #dd22dd;">{</span>
        <span style="color: #005f5f;">color</span>: <span style="color: #000000; background-color: #ffff00;">yellow</span>;
    <span style="color: #dd22dd;">}</span>
<span style="color: #000000;">}</span>

<span style="color: #8f0075;">@media</span> print <span style="color: #000000;">{</span>
    <span style="color: #531ab6;">div</span>
<span style="color: #531ab6;">    </span><span style="color: #dd22dd;">{</span>
        <span style="color: #005f5f;">color</span>: <span style="color: #ffffff; background-color: #800080;">purple</span>;
    <span style="color: #dd22dd;">}</span>
<span style="color: #000000;">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc84f6f6" class="outline-3">
<h3 id="orgc84f6f6"><span class="section-number-3">2.4.</span> CDN (Content Delivery Network)</h3>
</div>
</section>

<section id="outline-container-orgde797d6" class="outline-2">
<h2 id="orgde797d6"><span class="section-number-2">3.</span> bootstrap.css</h2>
<div class="outline-text-2" id="text-3">
<p>
<a href="https://www.bootcss.com/">https://www.bootcss.com/</a>
</p>

<p>
流行的、经典的、引领了一代潮流的、 <del>非前端开发人员</del> 必须掌握的一个 CSS 框架。
</p>

<p>
预定义样式 + 预定义样式类:
</p>
<ul class="org-ul">
<li>提供了更好的默认样式</li>
<li>栅格系统、响应式布局</li>
<li>组件化</li>
</ul>
</div>
</section>
</div>
<div id="postamble" class="status">
<p class="author">Author: 1a2y</p>
<p class="date">Created: 2023-02-27</p>
<p class="validation">Go ahead, never stop.</p>
</div>
</body>
</html>
